# Taps
tap "antoniorodr/memo"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "jackchuka/tap"
tap "nikitabobko/tap"
tap "specstoryai/tap"
tap "steipete/tap"
tap "yakitrak/yakitrak"

# Formulae
brew "act"
brew "bundler-completion"
brew "claude-squad"
brew "curl"
brew "fastly"
brew "fzf"
brew "gh"
brew "go"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jj"
brew "libass"
brew "libbluray"
brew "libdvdcss"
brew "liblqr"
brew "libraw"
brew "librist"
brew "libsoxr"
brew "libultrahdr"
brew "libvidstab"
brew "libzip"
brew "log4cxx"
brew "luarocks"
brew "mactop"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "node"
brew "openai-whisper"
brew "pipx"
brew "portaudio"
brew "python-tk@3.13"
brew "qt"
brew "rclone"
brew "rubberband"
brew "sip"
brew "spdlog"
brew "starship"
brew "tesseract"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "upx"
brew "watch"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zellij"
brew "zeromq"
brew "zimg"

# Tap Formulae
brew "antoniorodr/memo/memo"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jackchuka/tap/mdschema"
brew "specstoryai/tap/specstory"
brew "steipete/tap/gogcli"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "yakitrak/yakitrak/obsidian-cli"

# Casks
cask "bunch"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "iterm2"
cask "kiro"
cask "ngrok"
cask "nikitabobko/tap/aerospace"
cask "temurin@21"
cask "xquartz"

# VSCode Extensions
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "bierner.markdown-mermaid"
vscode "breaking-brake.cc-wf-studio"
vscode "charliermarsh.ruff"
vscode "ciantic.keymapceditor-vsc"
vscode "cognition.devin"
vscode "cstrap.flask-snippets"
vscode "cstrap.python-snippets"
vscode "ctenbrinke.vscode-tsv"
vscode "curdeveryday.vscode-m5stack-mpy"
vscode "dataform.dataform"
vscode "donjayamanne.python-environment-manager"
vscode "ecmel.vscode-html-css"
vscode "github.vscode-github-actions"
vscode "google.colab"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "greatminds.gitflow4code"
vscode "highagency.pencildev"
vscode "jackiotyu.git-worktree-manager"
vscode "jmrog.vscode-nuget-package-manager"
vscode "joedevivo.vscode-circuitpython"
vscode "kelvin.vscode-sshfs"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "parallelsdesktop.parallels-desktop"
vscode "pentium10.vscode-gcp-project-switcher"
vscode "philstainer.git-worktree"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "specstory.specstory-vscode"
vscode "statelyai.stately-vscode"
vscode "tailscale.vscode-tailscale"
vscode "vscodevim.vim"
vscode "vue.volar"

# Go Packages
go "github.com/goccy/bigquery-emulator/cmd/bigquery-emulator"
go "github.com/GoogleCloudPlatform/vertex-ai-creative-studio/experiments/mcp-genmedia/mcp-avtool-go"
go "github.com/GoogleCloudPlatform/vertex-ai-creative-studio/experiments/mcp-genmedia/mcp-genmedia-go/mcp-chirp3-go"
go "github.com/GoogleCloudPlatform/vertex-ai-creative-studio/experiments/mcp-genmedia/mcp-genmedia-go/mcp-imagen-go"
go "github.com/GoogleCloudPlatform/vertex-ai-creative-studio/experiments/mcp-genmedia/mcp-genmedia-go/mcp-lyria-go"
go "github.com/GoogleCloudPlatform/vertex-ai-creative-studio/experiments/mcp-genmedia/mcp-genmedia-go/mcp-veo-go"
