# Taps
tap "nikitabobko/tap"
tap "specstoryai/tap"
tap "FelixKratz/formulae"
tap "hashicorp/tap"

# Formulae
brew "abseil"
brew "act"
brew "aom"
brew "apr"
brew "apr-util"
brew "aribb24"
brew "brotli"
brew "bundler-completion"
brew "borders"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cjson"
brew "claude-squad"
brew "console_bridge"
brew "cunit"
brew "curl"
brew "dav1d"
brew "dbus"
brew "deno"
brew "double-conversion"
brew "fastly"
brew "ffmpeg"
brew "flac"
brew "fmt"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gettext"
brew "gh"
brew "giflib"
brew "glib"
brew "gmp"
brew "gnutls"
brew "go"
brew "graphite2"
brew "graphviz"
brew "gts"
brew "gumbo-parser"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "hunspell"
brew "icu4c@77"
brew "icu4c@78"
brew "imagemagick"
brew "imath"
brew "jasper"
brew "jj"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libdvdcss"
brew "libevent"
brew "libheif"
brew "libidn2"
brew "liblinear"
brew "liblqr"
brew "libmicrohttpd"
brew "libmng"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libraw"
brew "librist"
brew "librsvg"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libudfread"
brew "libultrahdr"
brew "libunibreak"
brew "libunistring"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libzip"
brew "litehtml"
brew "little-cms2"
brew "log4cxx"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mactop"
brew "md4c"
brew "mpdecimal"
brew "mpg123"
brew "ncurses"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "nmap"
brew "node"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openjph"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre2"
brew "pixman"
brew "portaudio"
brew "protobuf"
brew "python-packaging"
brew "python-tk@3.13"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "qt"
brew "qt3d"
brew "qt5compat"
brew "qtbase"
brew "qtcharts"
brew "qtconnectivity"
brew "qtdatavis3d"
brew "qtdeclarative"
brew "qtgraphs"
brew "qtgrpc"
brew "qthttpserver"
brew "qtimageformats"
brew "qtlanguageserver"
brew "qtlocation"
brew "qtlottie"
brew "qtmultimedia"
brew "qtnetworkauth"
brew "qtpositioning"
brew "qtquick3d"
brew "qtquick3dphysics"
brew "qtquickeffectmaker"
brew "qtquicktimeline"
brew "qtremoteobjects"
brew "qtscxml"
brew "qtsensors"
brew "qtserialbus"
brew "qtserialport"
brew "qtshadertools"
brew "qtspeech"
brew "qtsvg"
brew "qttools"
brew "qttranslations"
brew "qtvirtualkeyboard"
brew "qtwebchannel"
brew "qtwebengine"
brew "qtwebsockets"
brew "qtwebview"
brew "rav1e"
brew "rclone"
brew "readline"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "shared-mime-info"
brew "simdjson"
brew "sip"
brew "sketchybar"
brew "snappy"
brew "spdlog"
brew "specstory"
brew "speex"
brew "sqlite"
brew "srt"
brew "starship"
brew "svt-av1"
brew "tcl-tk"
brew "tesseract"
brew "terraform"
brew "theora"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "upx"
brew "utf8proc"
brew "uvwasi"
brew "watch"
brew "webp"
brew "wget"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yarn"
brew "yt-dlp"
brew "zellij"
brew "zeromq"
brew "zimg"
brew "zstd"

# Casks
cask "aerospace"
cask "bunch"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "iterm2"
cask "kiro"
cask "macdown"
cask "xquartz"
